Revit 2026 API

# RailingFlip Method

---

Flips the railing.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Flip()
```
```vb
Public Sub Flip
```
```cpp
public:
void Flip()
```
```fsharp
member Flip : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InapplicableDataException | The railing has incorrect internal data. |

#### Reference

Railing Class

Autodesk.Revit.DB.Architecture Namespace